export default {
    undefined: 'Undefined',
    banner: {},
    cookie: {
        message: 'Я використовую файли cookie на цьому сайті, щоб аналізувати трафік, запам’ятовувати ваші вподобання та оптимізувати ваш досвід.',
        action: 'Зрозуміло'
    },
    tooltips: {
        language: 'Мова',
        theme: 'Тема'
    },
    menu: {
        theme: {
            auto: 'Авто',
            light: 'Світла',
            dark: 'Темна'
        }
    },
    common: {
        explore: 'Дослідити'
    },
    pages: {
        undefined: {
            documentTitle: 'Undefined'
        },
        notFound: {
            documentTitle: 'Не Знайдено',
            title: 'Тут нічого :(',
            subtitle: 'Сторінка, яку ви шукали, не знайдена.',
            action: {
                goBack: 'Назад'
            }
        },
        error: {
            documentTitle: 'Помилка',
            title: 'Щось пішло не так!',
            subtitle: 'Оновіть сторінку або повторіть спробу пізніше.',
            action: {
                goHome: 'Додому'
            }
        },
        underConstruction: {
            documentTitle: 'У розробці',
            title: 'У розробці.',
            subtitle: 'Сторінка зараз недоступна.',
            action: {
                goHome: 'Додому'
            }
        },
        home: {
            documentTitle: 'Головна',
            railTitle: 'Головна',
            quote: {
                first: 'Простота',
                second: 'це найлегший шлях до істинної',
                third: 'краси.'
            },
            bio: {
                messageMe: "Я Jeffrey Turns, 19-річний розробник і UI/UX дизайнер з України. Зараз я навчаюся на комп'ютерного-інженера.",
                messageGoal:
                    'Моя мета — створювати рішення, які поєднують найновіші рекомендації Google щодо дизайну та сучасні та інноваційні цифрові технології.',
                action: 'Більше'
            },
            favoriteProjects: 'Улюблені проекти'
        },
        about: {
            documentTitle: 'Про мене',
            railTitle: 'Про мене',
            subtitleHeader: 'Корисна інформація і не тільки',
            textColumn: {
                aboutText:
                    "Привіт, я Jeffrey Turns. В даний час навчаюсь на комп'ютерного-інженера. Розробка під Android — це моє хобі, але я хочу перетворити це на роботу. Також мене цікавлять конкурси Telegram та веб-розробка.",
                copyrightTitle: 'Авторське право',
                copyrightText1:
                    'Авторські права можна знайти внизу кожної сторінки. Будь-яке відтворення, уривки або комерційне використання вимагає попереднього письмового дозволу від мене.',
                copyrightText2:
                    'Зображення, фотографії чи графіки, які використовуються на веб-сайті мого портфоліо, в основному захищені авторським правом. Вільне використання зображень заборонено.',
                linkTitle: 'Відповідальність за посиланням',
                linkText:
                    'Мій сайт містить посилання на зовнішні сторінки третіх сторін, на вміст яких я не маю впливу. Тому я не беру на себе жодної відповідальності за цей зовнішній вміст. Відповідний постачальник або оператор сторінок завжди несе відповідальність за вміст сторінок, на які посилаються. Сторінки, на які посилаються, були перевірені на можливі порушення законодавства під час створення посилань. Незаконний вміст не було розпізнано під час посилання.',
                contactTitle: "Зв'язок",
                contactText: "Ви можете зв'язатися зі мною за допомогою:"
            }
        },
        search: {
            documentTitle: 'Пошук'
        },
        privacyPolicy: {
            documentTitle: 'Політика Конфіденційності',
            railTitle: 'Політика'
        },
        projects: {
            documentTitle: 'Проєкти',
            railTitle: 'Проєкти',
            header: {
                title: 'Проєкти',
                subtitle: 'Всі цікаві роботи розроблені мною.'
            }
        },
        project: {
            documentTitle: 'Проєкт'
        },
        collections: {
            documentTitle: 'Колекції'
        }
    }
};
